In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Limpeza de dados

In [2]:
run_time = pd.read_excel('Data/Run Times.xlsx')
run_time.head(4)

,Name,Run Time,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
0,Alexis,9.2343,3.5,“school”,2023-04-15 12:00:00,2023-06-01,False,$0.00
1,Alexis,10.3842,3.5,School,2023-04-22 12:30:00,2023-06-01,True,$0.00
2,Alexis,8.1209,3 min,“the gym”,2023-05-10 15:00:00,2023-06-01,False,$2.50
3,David,7.2123,2.2,“school”,2023-05-01 15:15:00,2023-06-15,False,$0.00

In [3]:
run_time.dtypes

Name                    object
Run Time               float64
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                     object
dtype: object

In [4]:
run_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          5 non-null      object
 1   Run Time      5 non-null      float64
 2   Warm Up Time  5 non-null      object
 3   Location      5 non-null      object
 4   Run Date      5 non-null      datetime64[ns]
 5   Race Date     5 non-null      datetime64[ns]
 6   Rain          5 non-null      bool
 7   Fee           5 non-null      object
dtypes: bool(1), datetime64[ns](2), float64(1), object(4)
memory usage: 417.0+ bytes

convertendo para datetime

In [5]:
pd.to_datetime(run_time['Run Date'], format="%Y/%M/%D")

0   2023-04-15 12:00:00
1   2023-04-22 12:30:00
2   2023-05-10 15:00:00
3   2023-05-01 15:15:00
4   2023-05-10 16:30:00
Name: Run Date, dtype: datetime64[ns]

convertendo para numerico

In [6]:
removeChar = run_time['Fee'].str.replace('$','')
run_time['Fee'] = pd.to_numeric(removeChar)

In [7]:
run_time['Warm Up Time'] = pd.to_numeric(
    run_time['Warm Up Time'].astype(str).str.replace('min','')
    )

In [8]:
run_time['Rain'] = run_time['Rain'].astype(int)

In [9]:
run_time.dtypes

Name                    object
Run Time               float64
Warm Up Time           float64
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                     int64
Fee                    float64
dtype: object

In [10]:
run_time

,Name,Run Time,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
0,Alexis,9.2343,3.5,“school”,2023-04-15 12:00:00,2023-06-01,0,0.0
1,Alexis,10.3842,3.5,School,2023-04-22 12:30:00,2023-06-01,1,0.0
2,Alexis,8.1209,3.0,“the gym”,2023-05-10 15:00:00,2023-06-01,0,2.5
3,David,7.2123,2.2,“school”,2023-05-01 15:15:00,2023-06-15,0,0.0
4,David,6.8342,2.0,“gym”,2023-05-10 16:30:00,2023-06-15,0,2.5

In [11]:
alarmSurvey = pd.read_excel('Data/Alarm Survey Data.xlsx')
alarmSurvey.head(4)

,survey_id,age,number_of_children,activity_level,sleep_quality,number_of_snoozes,alarm_rating
0,1,34,3.0,active,3.0,1,5 stars
1,2,31,3.0,light,3.0,3,3 stars
2,3,18,0.0,light_activity,4.0,1,1 stars
3,4,42,4.0,active,4.0,1,4 stars

In [12]:
alarmSurvey.dtypes

survey_id               int64
age                     int64
number_of_children    float64
activity_level         object
sleep_quality         float64
number_of_snoozes       int64
alarm_rating           object
dtype: object

In [13]:
alarmSurvey = alarmSurvey['alarm_rating'].str.replace('stars','')\
    .astype(float)

In [14]:
student = pd.read_excel('Data/Student Grades.xlsx')
student.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [15]:
student.tail()

    Student Class    Year  Grade
81      NaN   NaN     NaN    NaN
82  Bennett   NaN     NaN    NaN
83      NaN   EDA  Junior   84.0
84    Gavin   EDA  Senior    NaN
85   Calvin   NaN     NaN  100.0

In [16]:
np.NaN, pd.NA

(nan, <NA>)

In [17]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  84 non-null     object
 1   Class    83 non-null     object
 2   Year     80 non-null     object
 3   Grade    82 non-null     float64
dtypes: float64(1), object(3)
memory usage: 2.8+ KB

In [18]:
student.isna().sum()

Student    2
Class      3
Year       6
Grade      4
dtype: int64

In [19]:
student['Year'].value_counts(dropna=False)

Year
Freshman     35
Sophomore    24
Junior       20
NaN           6
Senior        1
Name: count, dtype: int64

In [20]:
student.loc[student.isna().any(axis=1)]

    Student                      Class    Year  Grade
7     Jacob           Freshman Seminar     NaN   88.0
8   William           Freshman Seminar     NaN   89.0
9     Ethan           Freshman Seminar     NaN   86.0
62   Landon  Exploratory Data Analysis  Junior    NaN
81      NaN                        NaN     NaN    NaN
82  Bennett                        NaN     NaN    NaN
83      NaN                        EDA  Junior   84.0
84    Gavin                        EDA  Senior    NaN
85   Calvin                        NaN     NaN  100.0

Removendo valores

In [21]:
student.dropna()

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
76     Zoey               EDA    Junior   91.0
77    Aaron               EDA    Junior   85.0
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0

[77 rows x 4 columns]

In [22]:
student.dropna(how='all')

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
80    Riley               EDA    Junior   87.0
82  Bennett               NaN       NaN    NaN
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN
85   Calvin               NaN       NaN  100.0

[85 rows x 4 columns]

> Só irá remover as linhas que todos os valores possuem `Nan`

In [23]:
# A linhas que que não tiverem pelo menos 3 valores diferente de NaN será removidas
student.dropna(thresh=)

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN

[83 rows x 4 columns]

> `thresh=2` significa que irá remover linhas que não tiverem 3 valores `NaN`

In [24]:
student.dropna(subset=['Class'])

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN

[83 rows x 4 columns]

Só removeu valores nulos de uma colunas especifica no caso `Class`

In [25]:
student.loc[student['Class'].notna()]

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN

[83 rows x 4 columns]

> Selecionado valores diferente de NaN para a coluna city

In [26]:
student.dropna(subset=['Class','Student'],inplace=True)

In [27]:
student.isna().sum()

Student    0
Class      0
Year       3
Grade      2
dtype: int64

filna

In [28]:
student.fillna({'Grade':student['Grade'].mean()}, inplace= True)

In [29]:
student.isna().sum()

Student    0
Class      0
Year       3
Grade      0
dtype: int64

In [30]:
np.where(student['Student']=='Isaac', 'a', student['Student'])

array(['Emma', 'Olivia', 'Noah', 'Sophia', 'Liam', 'Mason', 'Isabella',
       'Jacob', 'William', 'Ethan', 'Ava', 'Michael', 'Alexander',
       'Logan', 'James', 'Daniel', 'Elijah', 'Benjamin', 'Mia', 'Mia',
       'Jayden', 'Aiden', 'Matthew', 'Emily', 'Jackson', 'Lucas', 'David',
       'Joseph', 'Abigail', 'Avery', 'Anthony', 'Dylan', 'Andrew',
       'Carter', 'Samuel', 'Gabriel', 'Joshua', 'John', 'Luke',
       'Christopher', 'Madison', 'Charlotte', 'a', 'a', 'a', 'Harper',
       'Ryan', 'Sofia', 'Elizabeth', 'Oliver', 'Henry', 'Sebastian',
       'Caleb', 'Owen', 'Hunter', 'Nathan', 'Wyatt', 'Amelia', 'Evelyn',
       'Jack', 'Ella', 'Chloe', 'Landon', 'Christian', 'Jordan',
       'Jonathan', 'Levi', 'Victoria', 'Aubrey', 'Jaxon', 'Julian',
       'Grace', 'Isaiah', 'Cameron', 'Eli', 'Angel', 'Zoey', 'Aaron',
       'Charles', 'Connor', 'Riley', 'Gavin'], dtype=object)

In [31]:
student['Student'].value_counts()

Student
Isaac      3
Mia        2
Landon     1
Ella       1
Jack       1
          ..
Joseph     1
David      1
Lucas      1
Jackson    1
Gavin      1
Name: count, Length: 79, dtype: int64

In [32]:
run_time['Location'] = \
    run_time['Location']\
            .str.replace('“','')\
            .str.replace('the','')\
            .str.replace('”','').str.lower()

In [33]:
run_time

,Name,Run Time,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
0,Alexis,9.2343,3.5,school,2023-04-15 12:00:00,2023-06-01,0,0.0
1,Alexis,10.3842,3.5,school,2023-04-22 12:30:00,2023-06-01,1,0.0
2,Alexis,8.1209,3.0,gym,2023-05-10 15:00:00,2023-06-01,0,2.5
3,David,7.2123,2.2,school,2023-05-01 15:15:00,2023-06-15,0,0.0
4,David,6.8342,2.0,gym,2023-05-10 16:30:00,2023-06-15,0,2.5